lisp/packages.org
#+title: Packages
#+author: Amo DelBello
#+description: "NO! The beard stays. You go."
#+startup: content

* Packages
** Ace Window
- Repo :: [[https://github.com/abo-abo/ace-window]]
  #+begin_src emacs-lisp
    (use-package ace-window
      :ensure t
      :bind
      (("C-o" . ace-window)
       ("C-x o" . ace-window))
      :config
      (defvar aw-dispatch-always nil)
      (setq aw-scope 'frame)
      (custom-set-faces
       '(aw-leading-char-face
         ((t (:inherit ace-jump-face-foreground :height 3.0))))))
  #+end_src
** aggressive-indent-mode
- Repo :: https://github.com/Malabarba/aggressive-indent-mode
  #+begin_src emacs-lisp
    (use-package aggressive-indent
      :ensure t
      :config
      (global-aggressive-indent-mode 1)
      (add-to-list 'aggressive-indent-excluded-modes 'html-mode))
  #+end_src
** AuTex
- Docs :: https://www.gnu.org/software/auctex/index.html
  #+begin_src emacs-lisp
    (use-package tex
      :ensure auctex
      :config (setq TeX-auto-save t
                    TeX-parse-self t)
              (setq-default TeX-master nil))
  #+end_src
** Avy
- Repo :: [[https://github.com/abo-abo/avy]]
  #+begin_src emacs-lisp
    (use-package avy
      :ensure t
      :bind (("C-'" . avy-goto-char)
             ("C-;" . avy-goto-char-2)
             :map org-mode-map
             ("C-'" . nil)))
  #+end_src
** Beacon
- Repo :: [[https://github.com/Malabarba/beacon]]
  #+begin_src emacs-lisp
    (use-package beacon
      :ensure t
      :config
      (beacon-mode 1)
      (setq beacon-blink-duration 0.5
            beacon-blink-delay 0.1))
  #+end_src
** buffer-move
- Repo :: https://github.com/lukhas/buffer-move
  #+begin_src emacs-lisp
    (use-package buffer-move
      :ensure t
      :bind
      (("<C-S-up>" . buf-move-up)
       ("<C-S-down>" . buf-move-down)
       ("<C-S-left>" . buf-move-left)
       ("<C-S-right>" .  buf-move-right)
       :map org-mode-map
       ("<C-S-up>" . buf-move-up)
       ("<C-S-down>" . buf-move-down)
       ("<C-S-left>" . buf-move-left)
       ("<C-S-right>" . buf-move-right)))
  #+end_src
** centaur-tabs
- Repo :: https://github.com/ema2159/centaur-tabs
  #+begin_src emacs-lisp
    (use-package centaur-tabs
      :ensure t
      :init
      (centaur-tabs-mode t)
      :config
      (setq centaur-tabs-style "bar"
            centaur-tabs-height 32
            centaur-tabs-set-icons t
            centaur-tabs-cycle-scope 'tabs
            centaur-tabs-set-modified-marker t
            centaur-tabs-set-bar 'under
            centaur-tabs-show-count nil
            x-underline-at-descent-line t
            uniquify-separator "/"
            uniquify-buffer-name-style 'forward
            centaur-tabs-left-edge-margin nil)
      (centaur-tabs-change-fonts (face-attribute 'default :font) 110)
      (centaur-tabs-group-by-projectile-project)
      (centaur-tabs-headline-match)
      :bind
      ("s-M-<left>" . centaur-tabs-backward)
      ("s-M-<right>" . centaur-tabs-forward)
      ("s-S-<left>" . centaur-tabs-move-current-tab-to-left)
      ("s-S-<right>" . centaur-tabs-move-current-tab-to-right)
      ("s-W" . centaur-tabs-kill-all-buffers-in-current-group)
      :hook
      (popper-mode . centaur-tabs-local-mode))

    (defun centaur-tabs-hide-tab (x)
      "Do not show buffer X in tabs."
      (let ((name (format "%s" x)))
        (or
         ;; Current window is not dedicated window.
         (window-dedicated-p (selected-window))

         ;; Buffer name not match below blacklist.
         (string-match "\\`\*.*'\*" name)

         ;; Is not magit buffer.
         (and (string-prefix-p "magit" name)
              (not (file-name-extension name)))
         )))
  #+end_src
** Company
- Repo :: https://github.com/company-mode/company-mode
- Docs :: https://company-mode.github.io/
  #+begin_src emacs-lisp
    (use-package company
      :ensure t
      :config
      (global-company-mode)
      (setq company-idle-delay 0.4
            company-show-numbers t
            company-tooltip-limit 10
            company-minimum-prefix-length 2
            company-tooltip-align-annotations t
            company-tooltip-flip-when-above nil)
      (custom-set-variables
       '(company-quick-access-modifier 'super))
      (use-package company-box
        :ensure t
        :hook
        (company-mode . company-box-mode)))
  #+end_src
** Crux
- Repo :: https://github.com/bbatsov/crux
- Docs :: [[https://emacsredux.com/blog/2016/01/30/crux/]]
  #+begin_src emacs-lisp
    (use-package crux
      :ensure t
      :bind
      (("s-o" . crux-smart-open-line-above)
       ("M-o" . crux-smart-open-line)

       ; this all of a sudden stopped working
       ; switching to coucel-recentf for now
       ; ("s-r" . crux-recentf-find-file)

       ("C-c D" . crux-delete-file-and-buffer)
       ("C-c d" . crux-duplicate-current-line-or-region)
       ("C-c M-d" . crux-duplicate-and-comment-current-line-or-region)
       ("C-c r" . crux-rename-file-and-buffer)
       ("s-j" . crux-top-join-line)
       ("s-k" . crux-kill-whole-line)
       ("<C-backspace>" . crux-kill-line-backwards)))
  #+end_src
** diff-hl
- Repo :: https://github.com/dgutov/diff-hl
  #+begin_src emacs-lisp
    (use-package diff-hl
      :ensure t
      :config
      (global-diff-hl-mode)
      :hook
      ((dired-mode . diff-hl-dired-mode)
       (magit-pre-refresh . diff-hl-magit-pre-refresh)
       (magit-post-refresh . diff-hl-magit-post-refresh)))
  #+end_src
** emacs-sqlite3
- Repo :: https://github.com/pekingduck/emacs-sqlite3-api
  #+begin_src emacs-lisp
    (use-package sqlite3
      :ensure t)
  #+end_src
** exec-path-from-shell
- Repo :: https://github.com/purcell/exec-path-from-shell
  #+begin_src emacs-lisp
    (when (memq window-system '(mac ns)) ;; MacOS
             (use-package exec-path-from-shell
               :ensure t
               :config
               (setq exec-path-from-shell-arguments nil) ; non-interactive, i.e. .zshenv not .zshrc
               (exec-path-from-shell-initialize)))
    (when (memq window-system '(x)) ;; Linux
             (use-package exec-path-from-shell
               :ensure t
               :config
               (exec-path-from-shell-initialize)))
  #+end_src
** expand-region
- Repo :: https://github.com/magnars/expand-region.el
  #+begin_src emacs-lisp
    (use-package expand-region
      :ensure t
      :bind (("C-=" . er/expand-region)
             ("C--" . er/contract-region)))
  #+end_src
** Eyebrowse
- Repo :: https://depp.brause.cc/eyebrowse/
  #+begin_src emacs-lisp
    (use-package eyebrowse
      :ensure t
      :config
      (eyebrowse-mode))
  #+end_src
** Flycheck
- Repo :: https://github.com/flycheck/flycheck
- Docs :: https://www.flycheck.org/en/latest/
  #+begin_src emacs-lisp
    (use-package flycheck
      :ensure t
      :init (global-flycheck-mode)
      :config
      (use-package flycheck-pos-tip
        :ensure t))
  #+end_src
** Flyspell
  #+begin_src emacs-lisp
    (setq-default ispell-program-name (dot-env-get 'ISPELL_PATH "/opt/homebrew/opt/ispell/bin/ispell"))

    (dolist (hook '(text-mode-hook))
      (add-hook hook (lambda ()
                       (flyspell-mode 1)
                       (define-key flyspell-mode-map (kbd "C-;") nil))))
  #+end_src
** git-messenger
- Repo :: https://github.com/emacsorphanage/git-messenger
  #+begin_src emacs-lisp
    (use-package git-messenger
      :ensure t
      :config (setq git-messenger:show-detail t
                    git-messenger:use-magit-popup t)
      :bind ("C-x m" . git-messenger:popup-message))
  #+end_src
** Git time machine
- Repo :: https://github.com/emacsmirror/git-timemachine
  #+begin_src emacs-lisp
    (use-package git-timemachine
      :ensure t)
  #+end_src
** goto-line-preview
- Repo :: https://github.com/emacs-vs/goto-line-preview
  #+begin_src emacs-lisp
    (use-package goto-line-preview
      :ensure t
      :config
      (global-set-key [remap goto-line] 'goto-line-preview))
  #+end_src
** gptel
- Repo :: https://github.com/karthink/gptel
  #+begin_src emacs-lisp
    (use-package gptel
      :ensure t
      :config
      (setq gptel-api-key (dot-env-get 'GPTEL_API_KEY)
            gptel-default-mode #'org-mode))
  #+end_src
** grip
- Repo :: https://github.com/seagle0128/grip-mode
  #+begin_src bash
    pip install grip
  #+end_src
  #+begin_src emacs-lisp
    (use-package grip-mode
      :ensure t
      :bind (:map markdown-mode-command-map
                  ("g" . grip-mode))
      :config (setq grip-preview-use-webkit t
                    grip-github-user "amodelbello"
                    grip-github-password (dot-env-get 'GRIP_GITHUB_PASSWORD)))
  #+end_src
