lisp/packages.el
(use-package ace-window
  :ensure t
  :bind
  (("C-o" . ace-window)
   ("C-x o" . ace-window))
  :config
  (defvar aw-dispatch-always nil)
  (setq aw-scope 'frame)
  (custom-set-faces
   '(aw-leading-char-face
     ((t (:inherit ace-jump-face-foreground :height 3.0))))))

(use-package aggressive-indent
  :ensure t
  :config
  (global-aggressive-indent-mode 1)
  (add-to-list 'aggressive-indent-excluded-modes 'html-mode))

(use-package tex
  :ensure auctex
  :config (setq TeX-auto-save t
                TeX-parse-self t)
          (setq-default TeX-master nil))

(use-package avy
  :ensure t
  :bind (("C-'" . avy-goto-char)
         ("C-;" . avy-goto-char-2)
         :map org-mode-map
         ("C-'" . nil)))

(use-package beacon
  :ensure t
  :config
  (beacon-mode 1)
  (setq beacon-blink-duration 0.5
        beacon-blink-delay 0.1))

(use-package buffer-move
  :ensure t
  :bind
  (("<C-S-up>" . buf-move-up)
   ("<C-S-down>" . buf-move-down)
   ("<C-S-left>" . buf-move-left)
   ("<C-S-right>" .  buf-move-right)
   :map org-mode-map
   ("<C-S-up>" . buf-move-up)
   ("<C-S-down>" . buf-move-down)
   ("<C-S-left>" . buf-move-left)
   ("<C-S-right>" . buf-move-right)))

(use-package centaur-tabs
  :ensure t
  :init
  (centaur-tabs-mode t)
  :config
  (setq centaur-tabs-style "bar"
        centaur-tabs-height 32
        centaur-tabs-set-icons t
        centaur-tabs-cycle-scope 'tabs
        centaur-tabs-set-modified-marker t
        centaur-tabs-set-bar 'under
        centaur-tabs-show-count nil
        x-underline-at-descent-line t
        uniquify-separator "/"
        uniquify-buffer-name-style 'forward
        centaur-tabs-left-edge-margin nil)
  (centaur-tabs-change-fonts (face-attribute 'default :font) 110)
  (centaur-tabs-group-by-projectile-project)
  (centaur-tabs-headline-match)
  :bind
  ("s-M-<left>" . centaur-tabs-backward)
  ("s-M-<right>" . centaur-tabs-forward)
  ("s-S-<left>" . centaur-tabs-move-current-tab-to-left)
  ("s-S-<right>" . centaur-tabs-move-current-tab-to-right)
  ("s-W" . centaur-tabs-kill-all-buffers-in-current-group)
  :hook
  (popper-mode . centaur-tabs-local-mode))

(defun centaur-tabs-hide-tab (x)
  "Do not show buffer X in tabs."
  (let ((name (format "%s" x)))
    (or
     ;; Current window is not dedicated window.
     (window-dedicated-p (selected-window))

     ;; Buffer name not match below blacklist.
     (string-match "\\`\*.*'\*" name)

     ;; Is not magit buffer.
     (and (string-prefix-p "magit" name)
          (not (file-name-extension name)))
     )))

(use-package company
  :ensure t
  :config
  (global-company-mode)
  (setq company-idle-delay 0.4
        company-show-numbers t
        company-tooltip-limit 10
        company-minimum-prefix-length 2
        company-tooltip-align-annotations t
        company-tooltip-flip-when-above nil)
  (custom-set-variables
   '(company-quick-access-modifier 'super))
  (use-package company-box
    :ensure t
    :hook
    (company-mode . company-box-mode)))

(use-package crux
  :ensure t
  :bind
  (("s-o" . crux-smart-open-line-above)
   ("M-o" . crux-smart-open-line)

   ; this all of a sudden stopped working
   ; switching to coucel-recentf for now
   ; ("s-r" . crux-recentf-find-file)

   ("C-c D" . crux-delete-file-and-buffer)
   ("C-c d" . crux-duplicate-current-line-or-region)
   ("C-c M-d" . crux-duplicate-and-comment-current-line-or-region)
   ("C-c r" . crux-rename-file-and-buffer)
   ("s-j" . crux-top-join-line)
   ("s-k" . crux-kill-whole-line)
   ("<C-backspace>" . crux-kill-line-backwards)))

(use-package diff-hl
  :ensure t
  :config
  (global-diff-hl-mode)
  :hook
  ((dired-mode . diff-hl-dired-mode)
   (magit-pre-refresh . diff-hl-magit-pre-refresh)
   (magit-post-refresh . diff-hl-magit-post-refresh)))

(use-package sqlite3
  :ensure t)

(when (memq window-system '(mac ns)) ;; MacOS
         (use-package exec-path-from-shell
           :ensure t
           :config
           (setq exec-path-from-shell-arguments nil) ; non-interactive, i.e. .zshenv not .zshrc
           (exec-path-from-shell-initialize)))
(when (memq window-system '(x)) ;; Linux
         (use-package exec-path-from-shell
           :ensure t
           :config
           (exec-path-from-shell-initialize)))

(use-package expand-region
  :ensure t
  :bind (("C-=" . er/expand-region)
         ("C--" . er/contract-region)))

(use-package eyebrowse
  :ensure t
  :config
  (eyebrowse-mode))

(use-package flycheck
  :ensure t
  :init (global-flycheck-mode)
  :config
  (use-package flycheck-pos-tip
    :ensure t))

(setq-default ispell-program-name (dot-env-get 'ISPELL_PATH "/opt/homebrew/opt/ispell/bin/ispell"))

(dolist (hook '(text-mode-hook))
  (add-hook hook (lambda ()
                   (flyspell-mode 1)
                   (define-key flyspell-mode-map (kbd "C-;") nil))))

(use-package git-messenger
  :ensure t
  :config (setq git-messenger:show-detail t
                git-messenger:use-magit-popup t)
  :bind ("C-x m" . git-messenger:popup-message))

(use-package git-timemachine
  :ensure t)

(use-package goto-line-preview
  :ensure t
  :config
  (global-set-key [remap goto-line] 'goto-line-preview))

(use-package gptel
  :ensure t
  :config
  (setq gptel-api-key (dot-env-get 'GPTEL_API_KEY)
        gptel-default-mode #'org-mode))

(use-package grip-mode
  :ensure t
  :bind (:map markdown-mode-command-map
              ("g" . grip-mode))
  :config (setq grip-preview-use-webkit t
                grip-github-user "amodelbello"
                grip-github-password (dot-env-get 'GRIP_GITHUB_PASSWORD)))
