lisp/packages.el

(global-set-key (kbd "C-x C-b") 'ibuffer)
(setq ibuffer-saved-filter-groups
      (quote (("default"
            ("org" (mode . org-mode))
            ("web" (or (mode . web-mode) (mode . js2-mode)))
            ("shell" (or (mode . eshell-mode) (mode . shell-mode)))
            ("programming" (or
                            (mode . emacs-lisp-mode)
                            (mode . lisp-mode)
                            (mode . clojure-mode)
                            (mode . clojurescript-mode)
                            (mode . python-mode)
                            (mode . c-mode)
                            (mode . c++-mode)))
            ("text" (mode . text-mode))
            ("LaTeX" (mode . latex-mode))
            ("magit" (mode . magit-mode))
            ("dired" (mode . dired-mode))
            ("emacs" (or
                      (name . "^\\*scratch\\*$")
                      (name . "^\\*Warnings\\*$")
                      (name . "^\\*Messages\\*$")))))))
(add-hook 'ibuffer-mode-hook
        (lambda ()
          (ibuffer-auto-mode 1)
          (ibuffer-switch-to-saved-filter-groups "default")))

;; Don't show filter groups if there are no buffers in that group
(setq ibuffer-show-empty-filter-groups nil)

(use-package idle-highlight-mode
  :ensure t
  :config
  (setq idle-highlight-idle-time 0.2
        idle-highlight-exclude-point t)
  :hook
  ((prog-mode text-mode) . idle-highlight-mode))

(use-package iedit
  :ensure t
  :bind ("C-\"" . iedit-mode))

(use-package ivy
  :ensure t
  :diminish (ivy-mode)
  :bind
  (("C-x b" . ivy-switch-buffer)
   ("C-c C-r" . ivy-resume)
   :map ivy-minibuffer-map
   ("M-y" . ivy-next-line)
   :map org-mode-map
   ("C-c C-r" . nil))
  :config
  (ivy-mode)
  (setq enable-recursive-minibuffers t
        ivy-use-virtual-buffers t
        ivy-count-format "%d/%d "
        ivy-display-style 'fancy
        ivy-re-builders-alist '((counsel-M-x . ivy--regex-fuzzy)
                                (counsel-describe-variable . ivy--regex-fuzzy)
                                (counsel-describe-function . ivy--regex-fuzzy)
                                (swiper-isearch . ivy--regex-plus)
                                (t . ivy--regex-plus)))
  (use-package ivy-hydra
    :ensure t))

(use-package counsel
  :ensure t
  :bind
  (("M-y" . counsel-yank-pop)
   ("M-x" . counsel-M-x)
   ("C-x C-f" . counsel-find-file)
   ("<f1> f" . counsel-describe-function)
   ("<f1> v" . counsel-describe-variable)
   ("<f1> l" . counsel-find-library)
   ("<f2> i" . counsel-info-lookup-symbol)
   ("<f2> u" . counsel-unicode-char)
   ("C-c g" . counsel-git) ; will override the keybinding for `magit-file-dispatch'
   ("C-c j" . counsel-git-grep)
   ("C-c a" . counsel-ag)
   ("C-c t" . counsel-load-theme)
   ("C-c m" . counsel-mark-ring)
   ("C-x l" . counsel-locate)
   ("M-y" . counsel-yank-pop)
   ("M-x" . counsel-M-x)
   ("s-r" . counsel-recentf)
   :map minibuffer-local-map
     ("C-r" . counsl-minibuffer-history)))

(use-package swiper
  :ensure t
  :bind
  (("C-s" . swiper-isearch)
   ("C-r" . swiper-isearch)
   :map read-expression-map
   ("C-r" . counsel-expression-history)))

(use-package ivy-rich
  :ensure t
  :config
  (ivy-rich-mode 1))

(use-package all-the-icons-ivy-rich
  :ensure t
  :config
  (all-the-icons-ivy-rich-mode 1)
  (setq all-the-icons-ivy-rich-color-icon t))

(use-package flx
  :ensure t)

(use-package orderless
  :ensure t
  :config
  (setq ivy-re-builders-alist '((t . orderless-ivy-re-builder)))
  (add-to-list 'ivy-highlight-functions-alist '(orderless-ivy-re-builder . orderless-ivy-highlight))
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

(use-package ivy-prescient
  :ensure t
  :config (ivy-prescient-mode 1))

(use-package json-mode
  :ensure t)

(use-package jump-char
  :ensure t
  :quelpa
  (dot-env :repo "lewang/jump-char"
           :fetcher github :upgrade t)
  :bind (("M-n" . jump-char-forward)
         ("M-N" . jump-char-backward)))

(use-package minions
  :ensure t
  :config
  (minions-mode 1))

(use-package magit
  :ensure t
  :bind
  (("C-x g" . magit)))
