lisp/packages.el

(defun amo/org-mode-hook ()
  (org-indent-mode 1)

  ;; For some reason org-mode doesn't respect visual-line-mode when it loads.
  (visual-line-mode 0)
  (visual-line-mode 1))
(add-hook 'org-mode-hook 'amo/org-mode-hook)

;; Disable checkdoc in org-mode source blocks
(defun amo/disable-fylcheck-in-org-src-block ()
  (setq-local flycheck-disabled-checkers '(emacs-lisp emacs-lisp-checkdoc)))
(add-hook 'org-src-mode-hook 'amo/disable-fylcheck-in-org-src-block)

(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c a") 'org-agenda)
(define-key org-mode-map (kbd "C-c m") 'counsel-org-goto)

(setq org-list-demote-modify-bullet
      '(("-" . "+") ("+" . "*") ("*" . "-"))
      org-list-allow-alphabetical t
      org-M-RET-may-split-line '((default . nil))
      org-use-tag-inheritance nil
      org-hide-emphasis-markers t
      org-directory (dot-env-get 'ORG_DIRECTORY_PATH "~/.emacs.d/org-directory")
      org-agenda-files (list org-directory)
      org-sprint-file (concat org-directory "/sprints.org")
      org-standup-file (concat org-directory "/standups.org")
      org-issue-file (concat org-directory "/issues.org")
      org-meeting-file (concat org-directory "/meeting-notes.org")
      org-union-file (concat org-directory "/union-notes.org")
      org-lists-file (concat org-directory "/lists.org")
      org-archive-location (concat org-directory "/_archive/%s_archive::"))

(setq org-capture-templates
      '(("s"
         "Sprint"
         entry
         (file org-sprint-file)
         "* %? %^G \nDEADLINE: %^t SCHEDULED: %^t %^{SCOPED_STORY_POINTS}p\n\n** Issues\n" :empty-lines-after 1 :prepend t)
        ("p"
         "Sprint Issue"
         entry
         (file org-sprint-file)
         "*** %? %^G \n %^{STORY_POINTS}p %^{ORIGINALLY_SCOPED}p %^{COMPLETED}p" :empty-lines 1 :prepend t)
        ("i"
         "Issue Note"
         entry
         (file+headline org-issue-file "Issue Items")
         "** %? %^G \n%T \n%i \n" :empty-lines 1 :prepend t)
        ("t"
         "Standup Note"
         entry
         (file+headline org-standup-file "Standup Items")
         "** %T Notes:\n%?\n%i\n" :empty-lines-after 1 :prepend t)
        ("m"
         "Meeting Note"
         entry
         (file+headline org-meeting-file "Meeting Items")
         "** %?\n%T\n%i\n" :empty-lines-after 1 :prepend t)
        ("u"
         "Union Note"
         entry
         (file+headline org-union-file "Meeting Items")
         "** %T %?\n%i\n" :empty-lines-after 1)
        ("e"
         "Emacs Idea"
         checkitem
         (file+headline org-lists-file "Emacs Ideas")
         "[ ] %?" :prepend t)
        ("k"
         "Keyboard Idea"
         checkitem
         (file+headline org-lists-file "Keyboard Ideas")
         "[ ] %?" :prepend t)
        ("r"
         "Interesting Albums"
         item
         (file+headline org-lists-file "Interesting Albums")
         "%?")))

(use-package org-superstar
  :ensure t
  :hook
  (org-mode . org-superstar-mode))

(use-package package-lint
  :ensure t)

(use-package paredit
  :ensure t
  :hook
  ((lisp-mode . paredit-mode)
   (emacs-lisp-mode . paredit-mode)
   (clojure-mode . paredit-mode)
   (clojurescript-mode . paredit-mode)
   (clojurec-mode . paredit-mode)
   (cider-repl-mode . paredit-mode)))

(use-package popper
  :ensure t ; or :straight t
  :bind (("s-3"   . popper-toggle-latest)
         ("s-4"   . popper-cycle)
         ("s-5" . popper-toggle-type))
  :init
  (setq popper-reference-buffers
        '("\\*format-all-errors\\*"
          "\\*lsp-log\\*"
          "\\*flycheck errors\\*"
          "\\*cider-error\\*"
          "\\*cider-scratch\\*"
          "\\*Messages\\*"
          "\\*Warnings\\*"
          "\\*Compile-Log\\*"
          "\\*Completions\\*"
          "\\*Backtrace\\*"
          "\\*TeX Help\\*"
          "Output\\*$"
          "\\*Async Shell Command\\*"
          "^pop-"
          help-mode
          compilation-mode)
        popper-mode-line ""

        ;; Make popper buffers 1/2 window height
        popper-window-height (lambda (win)
                               (fit-window-to-buffer
                                win
                                (floor (frame-height) 2))))
  (popper-mode +1)
  (popper-echo-mode +1)
  (defun amo/add-popper-status-to-modeline ()
    "If buffer is a popper-type buffer, display POP in the modeline,
  in a doom-modeline friendly way"
    (if (popper-display-control-p (buffer-name))
        (add-to-list 'mode-line-misc-info "POP")
      (setq mode-line-misc-info (remove "POP" mode-line-misc-info))))
  (add-hook 'buffer-list-update-hook 'amo/add-popper-status-to-modeline))

(use-package projectile
  :ensure t
  :config
  (projectile-global-mode)
  (setq projectile-completion-system 'ivy)
  :bind (("s-p" . projectile-command-map)
         ("C-c p" . projectile-command-map)))

(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package transpose-frame
  :ensure t
  :bind (("C->" . transpose-frame)))

(use-package treemacs
  :ensure t
  :defer t
  :config
  (treemacs-resize-icons 14)
  (define-key treemacs-mode-map [mouse-1] #'treemacs-single-click-expand-action))

(use-package
  treemacs-projectile
  :after (treemacs projectile)
  :ensure t)

(use-package treemacs-icons-dired
  :hook (dired-mode . treemacs-icons-dired-enable-once)
  :ensure t)

(use-package treemacs-magit
  :after (treemacs magit)
  :ensure t)

(use-package undo-tree
  :ensure t
  :config
  (global-undo-tree-mode)
  (setq undo-tree-history-directory-alist `((".*" . ,temporary-file-directory))
        undo-tree-auto-save-history t)
  :diminish
  (undo-tree-mode))

(use-package web-mode
  :ensure t
  :custom
  (setq web-mode-markup-indent-offset 2
        web-mode-code-indent-offset 2
        web-mode-css-indent-offset 2)
  :mode (("\\.js\\'" . web-mode)
         ("\\.jsx\\'" .  web-mode)
         ("\\.ts\\'" . web-mode)
         ("\\.tsx\\'" . web-mode)
         ("\\.html\\'" . web-mode))
  :commands web-mode)

(use-package which-key
  :ensure t
  :config
  (which-key-mode))

(use-package yasnippet
  :ensure t
  :config
  (yas-global-mode)
  (setq yas-snippet-dirs
        '("~/.emacs.d/snippets"))
  (use-package yasnippet-snippets
    :ensure t))

(use-package yascroll
  :ensure t
  :config
  (global-yascroll-bar-mode 0)          ; Slows down Emacs a lot. Disabling until there's a fix
  (setq yascroll:delay-to-hide nil
        yascroll:disabled-modes '(package-menu-mode image-mode)))
